In [1]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
customers=pd.read_csv(r"C:\Users\nihar\Downloads\restaurant_customers.csv")
customers

,ID,First Name,Last Name,Gender,Company,Occupation
0,1,Joseph,Perkins,Male,Dynazzy,Community Outreach Specialist
1,2,Jennifer,Alvarez,Female,DabZ,Senior Quality Engineer
2,3,Roger,Black,Male,Tagfeed,Account Executive
3,4,Steven,Evans,Male,Fatz,Registered Nurse
4,5,Judy,Morrison,Female,Demivee,Legal Assistant
...,...,...,...,...,...,...
995,996,Debra,Garcia,Female,Dazzlesphere,Structural Engineer
996,997,Douglas,Bishop,Male,Livepath,Developer I
997,998,Frank,Franklin,Male,Brainverse,Nurse Practicioner
998,999,Jessica,Burns,Female,Babbleblab,Financial Advisor
999,1000,Brian,Daniels,Male,Tazzy,Physical Therapy Assistant

In [3]:
foods=pd.read_csv(r"C:\Users\nihar\Downloads\restaurant_foods.csv")
foods

   Food ID   Food Item  Price
0        1       Sushi   3.99
1        2     Burrito   9.99
2        3        Taco   2.99
3        4  Quesadilla   4.25
4        5       Pizza   2.49
5        6       Pasta  13.99
6        7       Steak  24.99
7        8       Salad  11.25
8        9       Donut   0.99
9       10       Drink   1.75

In [4]:
sales1=pd.read_csv(r"C:\Users\nihar\Downloads\restaurant_week_1_sales.csv")
sales1

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
245          413        9
246          926        6
247          134        3
248          396        6
249          535       10

[250 rows x 2 columns]

In [5]:
sales2=pd.read_csv(r"C:\Users\nihar\Downloads\restaurant_week_2_sales.csv")
sales2

     Customer ID  Food ID
0            688       10
1            813        7
2            495       10
3            189        5
4            267        3
..           ...      ...
245          783       10
246          556       10
247          547        9
248          252        9
249          249        6

[250 rows x 2 columns]

In [6]:
times1=pd.read_csv(r"C:\Users\nihar\Downloads\restaurant_week_1_times.csv")
times1

    Time of Day
0      14:54:59
1      20:55:17
2      01:16:22
3      16:17:26
4      19:26:11
..          ...
245    04:44:14
246    07:46:21
247    20:45:08
248    01:09:06
249    18:18:50

[250 rows x 1 columns]

In [14]:
#Merging tables/DataFrames using concat function with common column names

In [15]:
foods.head(0)

Empty DataFrame
Columns: [Food ID, Food Item, Price]
Index: []

In [16]:
sales1.head(0)

Empty DataFrame
Columns: [Customer ID, Food ID]
Index: []

In [17]:
sales2.head(0)

Empty DataFrame
Columns: [Customer ID, Food ID]
Index: []

In [18]:
#These 3 datasets have three common columns 'Food ID' and 2 common columns 'Customer ID'

In [19]:
#Now we will merge sales1 and sales2

In [23]:
len(sales1)

250

In [24]:
len(sales2)

250

In [25]:
#sales1 and sales2 both have the same lengths making them suitable to merge

In [26]:
#To merge sales1 and sales2, use concat function

In [27]:
pd.concat([sales1,sales2])

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
245          783       10
246          556       10
247          547        9
248          252        9
249          249        6

[500 rows x 2 columns]

In [28]:
#It shows 500 rows meaning the datasets have been merged but sales2 starts from 0 again which is why the last row shows 249 instead of 500

In [29]:
pd.concat([sales1,sales2],ignore_index=False)

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
245          783       10
246          556       10
247          547        9
248          252        9
249          249        6

[500 rows x 2 columns]

In [ ]:
#ignore_index=False ignores any changes to be made to the dataset

In [30]:
pd.concat([sales1,sales2],ignore_index=True)

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
495          783       10
496          556       10
497          547        9
498          252        9
499          249        6

[500 rows x 2 columns]

In [31]:
#ignore_index=True combines the indices of both the datasets

In [32]:
pd.concat([sales1,sales2],keys=["Sales 1","Sales 2"]).sort_index()

             Customer ID  Food ID
Sales 1 0            537        9
        1             97        4
        2            658        1
        3            202        2
        4            155        9
...                  ...      ...
Sales 2 245          783       10
        246          556       10
        247          547        9
        248          252        9
        249          249        6

[500 rows x 2 columns]

In [33]:
#By assigning keys, we are assigning names to the indices and then using sort_index, the dataset is in alphabetical chronology

In [35]:
#concat using unequal lengths of datasets

In [37]:
df1=pd.DataFrame([1,2,3,],columns=["A"])
df1

   A
0  1
1  2
2  3

In [38]:
df2=pd.DataFrame([4,5,6],columns=["B"])
df2

   B
0  4
1  5
2  6

In [39]:
#The issue: using concat, the datasets can be merged but the second dataset comes below instead of adjacently

In [40]:
pd.concat([df1,df2])

     A    B
0  1.0  NaN
1  2.0  NaN
2  3.0  NaN
0  NaN  4.0
1  NaN  5.0
2  NaN  6.0

In [41]:
pd.concat([df1,df2],axis="index")

     A    B
0  1.0  NaN
1  2.0  NaN
2  3.0  NaN
0  NaN  4.0
1  NaN  5.0
2  NaN  6.0

In [42]:
pd.concat([df1,df2],axis="columns")

   A  B
0  1  4
1  2  5
2  3  6

In [43]:
#By assigning columns to the index, the datasets are now merged adjacently

In [44]:
#Merge: Left Joins

In [45]:
sales1.head()

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

In [46]:
foods.head()

   Food ID   Food Item  Price
0        1       Sushi   3.99
1        2     Burrito   9.99
2        3        Taco   2.99
3        4  Quesadilla   4.25
4        5       Pizza   2.49

In [47]:
#Food ID is the common column here. Now we want to merge the Food ID columns for sales1 and foods which becomes a Left Join

In [48]:
sales1.merge(foods,how="left",on="Food ID")

     Customer ID  Food ID   Food Item  Price
0            537        9       Donut   0.99
1             97        4  Quesadilla   4.25
2            658        1       Sushi   3.99
3            202        2     Burrito   9.99
4            155        9       Donut   0.99
..           ...      ...         ...    ...
245          413        9       Donut   0.99
246          926        6       Pasta  13.99
247          134        3        Taco   2.99
248          396        6       Pasta  13.99
249          535       10       Drink   1.75

[250 rows x 4 columns]

In [49]:
#Merge: Right Joins

In [50]:
sales2.head()

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10
3          189        5
4          267        3

In [51]:
customers.head()

   ID First Name Last Name  Gender  Company                     Occupation
0   1     Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
1   2   Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
2   3      Roger     Black    Male  Tagfeed              Account Executive
3   4     Steven     Evans    Male     Fatz               Registered Nurse
4   5       Judy  Morrison  Female  Demivee                Legal Assistant

In [53]:
#Now we want to merge Customer ID and ID from sales 2 and customers, respectively

In [54]:
sales2.merge(customers,how="left",left_on="Customer ID",right_on="ID")

,Customer ID,Food ID,ID,First Name,Last Name,Gender,Company,Occupation
0,688,10,688,Carl,Williamson,Male,Thoughtmix,Graphic Designer
1,813,7,813,Johnny,Walker,Male,Kayveo,Developer II
2,495,10,495,Deborah,Little,Female,Babbleblab,VP Accounting
3,189,5,189,Roger,Gordon,Male,Skilith,Operator
4,267,3,267,Matthew,Wood,Male,Agimba,Product Engineer
...,...,...,...,...,...,...,...,...
245,783,10,783,Phyllis,Meyer,Female,Voolia,Information Systems Manager
246,556,10,556,Samuel,Bailey,Male,Oyoloo,Nurse
247,547,9,547,Tina,Watkins,Female,Thoughtstorm,Accountant II
248,252,9,252,Douglas,Powell,Male,Jetwire,Geologist IV
249,249,6,249,Anthony,Carpenter,Male,Shuffletag,Health Coach I

In [ ]:
#The issue: the datasets have been merged but ID is a separate column

In [56]:
sales2.merge(customers,how="left",left_on="Customer ID",right_on="ID").drop("ID",axis="columns")

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation
0,688,10,Carl,Williamson,Male,Thoughtmix,Graphic Designer
1,813,7,Johnny,Walker,Male,Kayveo,Developer II
2,495,10,Deborah,Little,Female,Babbleblab,VP Accounting
3,189,5,Roger,Gordon,Male,Skilith,Operator
4,267,3,Matthew,Wood,Male,Agimba,Product Engineer
...,...,...,...,...,...,...,...
245,783,10,Phyllis,Meyer,Female,Voolia,Information Systems Manager
246,556,10,Samuel,Bailey,Male,Oyoloo,Nurse
247,547,9,Tina,Watkins,Female,Thoughtstorm,Accountant II
248,252,9,Douglas,Powell,Male,Jetwire,Geologist IV
249,249,6,Anthony,Carpenter,Male,Shuffletag,Health Coach I

In [57]:
#Now the datasets have been merged and Customer ID and ID have become a single column